package account;

public class Main {

	public static void main(String[] args) {
		/**
		 * 가게부를 관리하는 프로그렘 작성
		 * 메뉴
		 * 1. 내역 입력
		 * 2. 내역 수정
		 * 3. 내역 삭제
		 * 4. 내역 조회
		 * 5. 종료
		 * 메뉴선택 : 
		 * 
		 * if _ 1
		 * 수입/지출 : 수입
		 * 날짜 : 2021 - 06 - 10
		 * {분류 목록
		 * {월급
		 * {용돈
		 * {부수입//해당부분 123눌러서 돌아가게 만들어보자
		 * 분류 : 월급
		 * 금액 : 3000000
		 * 내용 : 6월달 월급 
		 * 
		 * if _ 2
		 * 날짜 : 2024-06-10
		 * 1.  2024-06-10 | 수입 | 월급 | 3000000 | 6월 월급
		 * 2. ...
		 * 3. ...
		 * 내역 선택 : if _ 1 >> 다시 다 입력 >> 교체 // 월급을 200만원으로 줄임
		 * 수정 완료
		 * 
		 * if _ 3
		 * 날짜 : 2024-06-10
		 * 1. 2024-06-10 | 수입 | 월급 | 2000000 | 6월 월급
		 * 2...
		 * 3...
		 * 내역 선택 : 1
		 * >> 내역 삭제
		 * 
		 * if _ 4 
		 * 날짜순으로 쭈욱 정렬해서 볼수 있게 하죠?
		 * 
		 */
		
		
		
	}

}
